xeecos/esp32c3-thermal/lib/hal/hal.cpp
#include "hal.h"
#include <ch32v20x.h>
#include <debug.h>
#include "MLX90640_I2C_Driver.h"
void hal_init()
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
    SystemCoreClockUpdate();
	Delay_Init();
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_GPIOB|RCC_APB2Periph_GPIOC, ENABLE);
    pinMode(GPIOA, GPIO_Pin_2, GPIO_Mode_Out_PP);
    MLX90640_I2CInit();
}
void pinMode(GPIO_TypeDef* port, uint16_t pin, GPIOMode_TypeDef mode)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    GPIO_InitStructure.GPIO_Pin = pin;
    GPIO_InitStructure.GPIO_Mode = mode;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(port, &GPIO_InitStructure);
}
void digitalWrite(GPIO_TypeDef* port, uint16_t pin, int val)
{
    if(val==HIGH)
    {
        GPIO_SetBits(port, pin);
    }
    else
    {
        GPIO_ResetBits(port, pin);
    }
}
int digitalRead(GPIO_TypeDef* port, uint16_t pin)
{
    return GPIO_ReadInputDataBit(port, pin);
}